---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.Clear
source: html/a8c4f11f-34cc-ef47-9501-9d7012b37d01.htm
---
# Autodesk.Revit.DB.ForgeTypeId.Clear Method

Sets the typeId to an empty string

## Syntax (C#)
```csharp
public ForgeTypeId Clear()
```